* ob-pasp
Org-Babel mode to execute Potassco Answer Set Programming code within Org-mode with =clingo=.

#+begin_src pasp :exports both
child(C, P) :- parent(P, C).
parent(vader, luke).
#show child/2.
#+end_src

#+RESULTS:
#+begin_example
clingo version 5.6.2
Reading from /tmp/babel-kEapMk/clingo-4cyjcS
Solving...
Answer: 1
child(luke,vader)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.000s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.000s
#+end_example

** Installation

The package is not (yet) available on MELPA, so the package should be installed from github directly.

*** Dependencies

To be able to use =ob-pasp= you will need to install =clingo= cli.

*** Doomemacs

In your =$DOOMDIR/packages.el= file, you might want to set up the following:
#+begin_src emacs-lisp
(package! pasp-mode)    ;; Add syntax highlighting for Potassco ASP
(package! ob-pasp
  :recipe (:host github :repo "samuelortion/ob-pasp"))
#+end_src

*** TODO Spacemacs :help-wanted:

*** =use-package= with =straight=
The following instructions should work, but I am not sure.
#+begin_src emacs-lisp
(use-package ob-pasp
  :straight (ob-pasp :type git :host github :repo "samuelortion/ob-pasp"))
#+end_src
